// Напишите программу, которая на вход принимает позиции элемента в двумерном массиве,
// и возвращает значение этого элемента или же указание, что такого элемента нет.

int row = ReadInt("Введите индекс строки: ");
int column = ReadInt("Введите индекс столбца: ");
int[,] numbers = new int[5, 6];
FillArray2D(numbers);
PrintArray2D(numbers);

if (row < numbers.GetLength(0) && column < numbers.GetLength(1)) Console.WriteLine(numbers[row, column]);
else Console.WriteLine($"{row}{column} -> такого числа в массиве нет");

void FillArray2D(int[,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            array[i, j] = new Random().Next(1, 10);
        }
    }
}

void PrintArray2D(int[,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            Console.Write(array[i, j] + " ");
        }
        Console.WriteLine();
    }
    Console.WriteLine();
}

int ReadInt(string message)
{
    Console.Write(message);
    return Convert.ToInt32(Console.ReadLine());
}

